app/Http/Resources/PersonalResource.php

select `worktime` from `personal_times` where `pers_id` = '41' and day(`date`) >= '02' and day(`date`) <= '8' and month(`date`) = '07' and year(`date`) = '2018'
---
    private function previousWeeksCloseHours()
    {
        $date = new DateTime('previous week monday');

        return PersonalTime::select('worktime')
            ->where('pers_id', $this->pers_id)
            ->whereDay('date', '>=', $date->format('d'))
            ->whereDay('date', '<=', $date->format('d') + 6)
            ->whereMonth('date', $date->format('m'))
            ->whereYear('date', $date->format('Y'))
            ->get();