app/Http/Controllers/PersonalController.php

    public function index()
    {
        $date = new DateTime('-1 month');

        $year = $date->format('Y');
        $month = $date->format('m');

        $personal = Personal::where('is_active', 1)->with(['times' => function ($query) use ($month, $year) {
            $query->select(DB::raw('sum(worktime) as totaltime'), 'worktime', 'pers_id', 'task_id')
                ->whereYear('date', $year)
                ->whereMonth('date', $month)
                ->groupBy('task_id')
                ->groupBy('pers_id');
        }])->with(['tasks' => function ($query) use ($month, $year) {
                $query->groupBy('task_id')
                    ->groupBy('personal_times.pers_id')
                    ->groupBy('personal_times.task_id')
                    ->whereMonth('personal_times.date', $month)
                    ->whereYear('personal_times.date', $year);
        }])->with(['salary' => function ($query) use ($month, $year) {
                $query->whereYear('date', $year)
                ->whereMonth('date', $month)
                ->orderBy('date', 'desc');
        }])
            ->paginate(25);
---
select `date` from `personal_times` order by `date` desc
select * from `salaries` where `salaries`.`pers_id` in ('41') and year(`date`) = '2018' and month(`date`) = '7' order by `date` desc
select * from `tasks` where `tasks`.`task_id` in ('27', '89', '1460', '3231', '3272')
select sum(worktime) as totaltime, `worktime`, `pers_id`, `task_id` from `personal_times` where `personal_times`.`pers_id` in ('41') and year(`date`) = '2018' and month(`date`) = '7' group by `task_id`