app/Http/Controllers/PersonalController.php

    public function show($id, Request $request)
    {
        //Если есть дата делаем переменную для запроса
        $date = input_date($request->filled('date'), $request->date);

        //Достаем все что вообще можно
        $first = Personal::where('is_active', 1)->where('pers_id', $id)
        ->with(['times' => function ($query) use ($date) {
            $query->select(DB::raw('sum(worktime) as totaltime'), 'worktime', 'pers_id', 'task_id')
                ->whereYear('date', (int)$date[0])
                ->whereMonth('date', (int)$date[1])
                ->groupBy('task_id')->with(['tasks' => function ($query) {
                    $query->with('projects');
                }]);
        }])->with(['salary' => function ($query) use ($date) {
                $query->whereYear('date', (int)$date[0])
                ->whereMonth('date', (int)$date[1])
                ->orderBy('date', 'desc');
        }])
            ->firstOrFail();
---
select * from `projects` where `projects`.`project_id` in ('4', '7', '17', '42', '70')