app/Http/Controllers/Api/Personal/CompanyController.php

    public function getCompanies()
    {
        $personalCompanies = PersonalCompany::select('id', 'name')->get();
---
select `id`, `name` from `personal_companies`