app/Http/Controllers/Api/Personal/CostController.php

    public function index(DateRequest $request)
    {
        $date = explode('-', $request->date);

        $cost = Cost::select('cost')
            ->whereYear('date', $date[self::DATE_YEAR])
            ->whereMonth('date', $date[self::DATE_MONTH])
            ->firstOrFail();
---
select `cost` from `costs` where year(`date`) = '2018' and month(`date`) = '07' limit 1