app/Http/Controllers/Api/Personal/GroupController.php

    public function getGroups()
    {
        $personalGroups = PersonalGroup::select('id', 'name')->get();
---
select `id`, `name` from `personal_groups`

    public function teamleads()
    {
        $group = PersonalGroup::where('index','teamlid')->first();

        if ($group) {
            $personals = Personal::where('group_id', $group->id)->get();
---
select * from `personal_groups` where `index` = 'teamlid' limit 1
select * from `personal` where `group_id` = '6'