app/Http/Controllers/Api/Personal/PersonalController.php

    public function getCompanyGroupPersonal($personalId)
    {
        $personal = Personal::select('company_id', 'group_id')
            ->where('pers_id', $personalId)
            ->with('company', 'group')
            ->firstOrFail();
---
select `company_id`, `group_id` from `personal` where `pers_id` = '41' limit 1

    public function addPersonal($personalId, AddPersonalRequest $request)
    {
        $user = Personal::find($personalId);
        $owner = Personal::find($request->user_id);
        $user->owners()->sync([
            'owner_id'  => $owner->pers_id,
            'user_id'  => $user->pers_id,
            'group_id'  => $owner->group_id
            ]
        );
---
select * from `personal` where `personal`.`pers_id` = '2' limit 1
select * from `personal` where `personal`.`pers_id` is null limit 1
select * from `personal` where `personal`.`pers_id` = '41' limit 1