app/Http/Controllers/Api/Personal/ProjectCostController.php

    private function getProjectCost($persId, $date)
    {
        return ProjectCost::select('hours', 'project_id', 'percent', 'cost_override', 'project_cost')
            ->whereYear('date', $date[self::DATE_YEAR])
            ->whereMonth('date', $date[self::DATE_MONTH])
            ->with('projects')
            ->where('pers_id', $persId)
            ->get();
---
select `hours`, `project_id`, `percent`, `cost_override`, `project_cost` from `project_costs` where year(`date`) = '2018' and month(`date`) = '07' and `pers_id` = '41'

    private function getPersonalTime($id, $date)
    {
        return PersonalTime::select(
            DB::raw('sum(worktime) as worktime'),
            'projects.name',
            'projects.project_id'
        )
            ->where('personal_times.pers_id', $id)
            ->groupBy('tasks.project_id')
            ->whereMonth('personal_times.date', $date[self::DATE_MONTH])
            ->whereYear('personal_times.date', $date[self::DATE_YEAR])
            ->join('tasks', function ($join) {
                $join->on('tasks.task_id', '=', 'personal_times.task_id');
            })
            ->join('projects', function ($join) {
                $join->on('projects.project_id', '=', 'tasks.project_id');
            })
            ->get();
---
select sum(worktime) as worktime, `projects`.`name`, `projects`.`project_id` from `personal_times` inner join `tasks` on `tasks`.`task_id` = `personal_times`.`task_id` inner join `projects` on `projects`.`project_id` = `tasks`.`project_id` where `personal_times`.`pers_id` = '41' and month(`personal_times`.`date`) = '07' and year(`personal_times`.`date`) = '2018' group by `tasks`.`project_id`