app/Http/Controllers/Api/Personal/SalaryController.php

    public function update(SalaryRequest $request, $salaryId)
    {
        $salary = Salary::where('id', $salaryId)
            ->update([
                'coefficient' => $request->coefficient,
                'fix' => $request->fix,
                'salary' => $request->salary,
                'close_hours' => $request->closeHours,
                'salary_hours' => $request->salaryHours,
                'penalty_hours' => $request->penaltyHours,
            ]);
---
select `id`, `coefficient`, `fix`, `salary`, `close_hours`, `salary_hours`, `penalty_hours` from `salaries` where `pers_id` = '18' and year(`date`) = '2018' and month(`date`) = '07' limit 1