app/Http/Controllers/Api/Personal/TeamleadController.php

select * from `personal` where `pers_id` = '27' limit 1
select * from `personal` where `personal`.`teamlead_id` = '27' and `personal`.`teamlead_id` is not null limit 75 offset 0
select count(*) as aggregate from `personal` where `personal`.`teamlead_id` = '27' and `personal`.`teamlead_id` is not null
---
    public function users($personalId)
    {
        $user = Personal::where('pers_id', $personalId)->first();

        if (!$user) {
            abort(404);
        }

        $users = $user->teamleadPersonals();

        return PersonalShortResource::collection($users->paginate(75))
            ->additional(['success' => true]);

select * from `personal` where `pers_id` = '58' limit 1
select * from `personal` where `pers_id` = '25' limit 1
---
    public function addPersonal($personalId, AddPersonalRequest $request)
    {
        $user = Personal::where('pers_id', $personalId)->first();
        if (!$user) {
            return response()->errors(make_error('not_found', 'Пользователь не найден.'), 404);
        }
        $owner = Personal::where('pers_id', $request->teamlead_id)->first();