app/Http/Controllers/Api/Report/Project/StatusController.php

select `id`, `name` from `project_statuses`
---
    public function index()
    {
        $projectStatuses = ProjectStatus::select('id', 'name')->get();